print("กิจกรรมท้ายบท\n1.)โปรเเกรมสอบถามการทำบัตรเครดิต โดยต้องมีรายได้ 15000 บาท จึงจะทำบัตรเครดิตได้ โดยมีเงื่อนไขดังนี้")
print("    หากรายได้ตํ่ากว่า 70,000 บาท ทำบัตรเงิน\n    หากรายได้ตํ่ากว่า 100,000 บาท ทำบัตรทอง\n    หากรายได้มากกว่า 100,000 ทำบัตร Platinum\n--------------------------")
n = int(input("ระบุเงินเดือนของคุณ : "))
if(n<15000) :
    print("คุณไม่สามารถทำรายการได้")
elif(n<=70000) :
    print("คุณสามารถทำบัตรเงินได้")
elif(n<=100000) :
    print("คุณสามารถทำบัตรทองได้")
else :
    print("คุณสามารถทำบัตรPlatinumได้")
