print("2.)โปรเเกรมคำนวนเกรด โดยมีเกณฑ์ดังนี้")
print("          ถ้าคะเเนนมากกว่าหรือเท่ากับ 80 ให้เท่ากับ A\n          ถ้าคะเเนนอยู่ในช่วง 70-79 ให้เท่ากับ B\n          ถ้าคะเเนนอยู่ในช่วง 60-69 ให้เท่ากับ C\n          ถ้าคะเเนนอยู่ในช่วง 50-59 ให้เท่ากับ D\n          ถ้าคะเเนนตํ่ากว่า 50 ให้เท่ากับ F\n--------------------------------------")
n = float(input("คะเเนนของคุณ"))
if(n>=80) :
    print("เกรด A")
elif(70<=n<80) :
    print("เกรด B")
elif(60<=n<70) :
    print("เกรด C")
elif(50<=n<60) :
    print("เกรด D")
else :
    print("เกรด F")
